btn_ok = Tamam
txt_op_count = Operasyon say\u0131s\u0131
op_count_stage.title = Operasyon Say\u0131s\u0131
btn_capture_camera = Kameradan Al
btn_capture_file = Videodan Al
btn_capture_image = Resim Kaydet
btn_save_ops = Ayarlar\u0131 Kaydet
btn_load_ops = Ayarlar\u0131 Dosyadan Al
btn_reset_ops = Ayarlar\u0131 S\u0131f\u0131rla
txt_operation = Operasyon 
txt_crop_low = K\u0131rpma alt de\u011feri
txt_crop_high = K\u0131rpma \u00fcst de\u011feri
txt_clahe_clip_limit = K\u0131rpma \u00dcst De\u011feri
txt_clahe_clip_size = Pencere B\u00fcy\u00fckl\u00fc\u011f\u00fc
txt_convolution = Konvol\u00fcsyon \u00e7ekirde\u011fi
txt_brightnesss = Parlakl\u0131k De\u011feri
txt_contrast = Kontrast De\u011feri
txt_deter_coef = Eskitme Miktar\u0131
txt_blur_kernel_size = Pencere Boyutu
txt_set_rgb = Sabit R, G, B de\u011ferleri
txt_change_rgb = R, G, B de\u011ferleri\n(Negaif olabilir)
txt_ghost_size = Frame Say\u0131s\u0131
btn_apply = Uygula
res_warning = Uygulaman\u0131n ekrana s\u0131\u011fmas\u0131 i\u00e7in en az 1024X640 \u00e7\u00f6z\u00fcn\u00fcrl\u00fc\u011fe ihtiyac\u0131n\u0131z olacakt\u0131r.
msg_image_saved = Anl\u0131k resim masa\u00fcst\u00fcne kaydedilmi\u015ftir
msg_image_not_saved = Anl\u0131k resim kaydedilirken hata olu\u015ftu !
warning = Uyar\u0131
file_chooser.title = Video dosyas\u0131 se\u00e7iniz
file_chooser.ext = Video Dosyalar\u0131
file_chooser.operations.title = Ayar dosyas\u0131 se\u00e7iniz
file_chooser.operations.ext = Ayar Dosyalar\u0131
config.saved = Operasyonlar masa\u00fcst\u00fcne ba\u015far\u0131yla kaydedildi
config.notsaved = Ayarlar kaydedilemedi
config.loaded = Ayarlar ba\u015far\u0131yla y\u00fcklendi
config.notloaded = Ayarlar y\u00fcklenemedi
config.notloaded.too_much = Y\u00fcklenmeye \u00e7al\u0131\u015f\u0131lan operasyon say\u0131s\u0131 \u00e7ok fazla.\nY\u00fcklenmeye \u00e7al\u0131\u015f\u0131lan: 
how_to = Bu program e\u011fitim veya ara\u015ft\u0131rma ama\u00e7l\u0131 kullan\u0131labilir.\n\nRealtime Image Processing ger\u00e7ek zamanl\u0131 bir g\u00f6r\u00fcnt\u00fc i\u015fleme program\u0131d\u0131r ve kameradan veya bir video dosyas\u0131ndan ald\u0131\u011f\u0131 g\u00f6r\u00fcnt\u00fcy\u00fc anl\u0131k olarak i\u015flemekte ve \u00fcst\u00fcnde 10 adete kadar farkl\u0131 efekti s\u0131ras\u0131yla uygulayabilmektedir. Uygulanmas\u0131 istenen efektler numara s\u0131ras\u0131yla \u00fcst \u00fcste uygulanacakt\u0131r. Program\u0131n Resmi Kaydet fonksiyonu g\u00f6r\u00fcnt\u00fclenen anl\u0131k resmi masa\u00fcst\u00fcne saved<Tarih-saat>.bmp ismi ile kaydeder. Ayarlar\u0131 kaydet fonksiyonu ge\u00e7erli efektleri otomatik olarak masa\u00fcst\u00fcne operations<Tarih-saat>.cfg isimli bir dosyaya yazacakt\u0131r. Ayarlar\u0131 dosyadan al se\u00e7ene\u011fi ile dosya se\u00e7erek yedekledi\u011finiz efektleri tekrar y\u00fckleyebilirsiniz. Ayarlar\u0131 s\u0131f\u0131rla se\u00e7ene\u011fi ile yapt\u0131\u011f\u0131n\u0131z efektlerin hepsini orjinal haline getirebilirsiniz. Programda uygulayabilece\u011finiz efektler a\u015fa\u011f\u0131daki gibidir:\n\nGri Tonuna \u00c7evirme efekti anl\u0131k resim gri tonlar\u0131na \u00e7evirir. Resim tek kanall\u0131 hale gelecektir.\n\nBinary G\u00f6r\u00fcnt\u00fc Olu\u015fturma ile anl\u0131k resim \u00f6nce gri seviyeli resime sonra 0 ve 1 'lere \u00e7evirilir. Resim tek kanall\u0131 hale gelecektir.\n\nNegatif Olu\u015fturma ile anl\u0131k resimdeki b\u00fct\u00fcn renk de\u011ferlerinin tersi (255 - renk) al\u0131nmaktad\u0131r.\n\nParlakl\u0131k Ayar\u0131 ile anl\u0131k resmin parlakl\u0131\u011f\u0131n\u0131 artt\u0131r\u0131p azaltabilirsiniz.\n\nKontrast Ayar\u0131 ile anl\u0131k resmin kontrast oran\u0131n\u0131 artt\u0131r\u0131p azaltabilirsiniz.\n\nRenk K\u0131rpma ile anl\u0131k resimdeki b\u00fct\u00fcn pixellerin Red, Green veya Blue de\u011ferlerini belli seviyeler aras\u0131na atayabilirsiniz. Bo\u015f b\u0131rak\u0131lan de\u011ferlere dokunulmayacakt\u0131r. \u00d6rne\u011fin alt seviye 100 ise b\u00fct\u00fcn pixellerin 3 kanal\u0131nda 100 'den k\u00fc\u00e7\u00fck olan de\u011ferler 100 'e e\u015fitlenecektir. Kontrast azaltma i\u015flemine benzemektedir.\n\nRGB Sabitleme ile anl\u0131k resimdeki b\u00fct\u00fcn pixellerin Red, Green veya Blue de\u011ferlerini ayr\u0131 ayr\u0131 sabit bir de\u011fere atayabilirsiniz. Negatif yazamazs\u0131n\u0131z. Bo\u015f b\u0131rak\u0131lan de\u011ferler oldu\u011fu gibi kalacakt\u0131r. \u00d6rne\u011fin Red kanal\u0131na 100 yazarsan\u0131z ve di\u011ferlerini bo\u015f b\u0131rak\u0131rsan\u0131z b\u00fct\u00fcn pixeller (100, G, B) \u015feklinde de\u011fi\u015ftirilecektir. Green ve Blue kanallar\u0131na dokunulmayacakt\u0131r.\n\nRGB Artt\u0131r / Azalt ile anl\u0131k resimdeki b\u00fct\u00fcn pixellerin Red, Green veya Blue de\u011ferlerini ayr\u0131 ayr\u0131 artt\u0131rabilir veya azaltabilirsiniz. Negatif de\u011ferler yaz\u0131l\u0131rsa azaltma i\u015flemi yapacakt\u0131r. RGB Sabitleme i\u015flemie benzer \u015fekilde fakat ondan farkl\u0131 olarak b\u00fct\u00fcn pixellerin Red Green ve Blue de\u011ferleri verilen de\u011ferlerle toplanacak veya negatifse \u00e7\u0131kart\u0131lacakt\u0131r. 0 yaz\u0131l\u0131rsa veya bo\u015f b\u0131rak\u0131l\u0131rsa dokunulmam\u0131\u015f olacakt\u0131r. \u00d6rne\u011fin Red kanal\u0131na 100 yazarsan\u0131z ve di\u011ferlerine 0 yazarsan\u0131z b\u00fct\u00fcn pixeller (R + 100, G, B) \u015feklinde de\u011fi\u015ftirilecektir. Green ve Blue kanallar\u0131na dokunulmayacakt\u0131r.\n\nTemizlik ile anl\u0131k resim \u00fczerinde dilation ismi verilen i\u015flem uygulan\u0131r. Binary g\u00f6r\u00fcnt\u00fclerde kullan\u0131lmas\u0131 daha kullan\u0131\u015fl\u0131d\u0131r. G\u00fcr\u00fclt\u00fc azaltma i\u015flemine benzer bir efekt uygulamaktad\u0131r.\n\nA\u015f\u0131nd\u0131rma ile anl\u0131k resim \u00fczerinde erode ismi verilen i\u015flem uygulan\u0131r. Binary g\u00f6r\u00fcnt\u00fclerde kullan\u0131lmas\u0131 daha kullan\u0131\u015fl\u0131d\u0131r. Beyaz i\u00e7indeki siyah alanlar\u0131n daha d\u00fczg\u00fcn g\u00f6r\u00fcnmesini sa\u011flayabilir.\n\nEskitme ile anl\u0131k resim \u00fczerinde kontrast artt\u0131rma i\u015flemine benzer \u015fekilde parlak renkleri daha parlak ve koyu renkleri daha koyu yapabilirsiniz. B\u00fct\u00fcn renk de\u011ferlerine verilen asy\u0131n\u0131n toplanmas\u0131 veya \u00e7\u0131kar\u0131lmas\u0131 \u015feklinde \u00e7al\u0131\u015fmaktad\u0131r. Y\u00fcksek say\u0131lar verilirse renk kay\u0131plar\u0131 olu\u015fturacakt\u0131r. Gri seviyeli resim \u00fczerinde \u00e7al\u0131\u015fmaz.\n\nBulan\u0131kla\u015ft\u0131rma ile belli b\u00fcy\u00fckl\u00fckteki bir pencere anl\u0131k resim \u00fczerinde gezdirilerek pixeller kar\u0131\u015ft\u0131r\u0131l\u0131r ve g\u00f6r\u00fcnt\u00fc bulan\u0131kla\u015ft\u0131r\u0131l\u0131r.\n\nCLAHE ile anl\u0131k resim \u00fczerinde contrast limited adaptice histogram equalization uygulayabilirsiniz. Bu efekt ile resim \u00fczerindeki parlakl\u0131k farkl\u0131l\u0131klar\u0131ndan etkilenmeden koyu ve a\u00e7\u0131k renkleri ay\u0131rt edebilirsiniz. Gri seviyeli resim olu\u015fturacakt\u0131r.\n\nHayalet efekti belirtilen frame say\u0131s\u0131 kadar ge\u00e7mi\u015f kareleri haf\u0131zada tutarak yeni kareden eskiye a\u011f\u0131rl\u0131klar\u0131 azaltarak toplama i\u015flemi yapar ve s\u00fcz\u00fclme efekti verir.\n\n\u00d6zel Tan\u0131ml\u0131 Konvol\u00fcsyon ile belirledi\u011finiz 3X3 'l\u00fck bir pencere anl\u0131k resim \u00fczerinde gezdirilir ve pixellere \u00e7arp\u0131p toplanarak uygulan\u0131r. Bu efekt ile kendi kenar yakalama veya bulan\u0131kla\u015ft\u0131rma modelinizi de geli\u015ftirebilirsiniz.\n\nKenar Yakalama ile anl\u0131k resim \u00fczerindeki cisimlerin yatay ve dikey kenarlar\u0131n\u0131 bulabilirsiniz.\n
ops.normal = Normal
ops.edge_detect = Kenar Yakalama
ops.grayscale = Gri Tonuna \u00c7evirme
ops.binary = Binary G\u00f6r\u00fcnt\u00fc Olu\u015fturma
ops.blurred = Bulan\u0131kla\u015ft\u0131rma
ops.negative = Negatif Olu\u015fturma
ops.convolution = \u00d6zel Tan\u0131ml\u0131 Konvol\u00fcsyon
ops.brightnesss = Parlakl\u0131k Ayar\u0131
ops.set_RGB = RGB Sabitleme
ops.change_RGB = RGB Artt\u0131r / Azalt
ops.crop_RGB = Renk K\u0131rpma
ops.dilate = Temizlik
ops.erode = A\u015f\u0131nd\u0131rma
ops.deterioration = Eskitme
ops.clahe = CLAHE
ops.contrast = Kontrast Ayar\u0131
ops.ghost = Hayalet